18-rails-review/app/controllers/bloggers_controller.rb

INSERT INTO "bloggers" ("name", "bio", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
    def create
        @blogger = Blogger.new(blogger_params)

        if @blogger.save

SELECT  "bloggers".* FROM "bloggers" WHERE "bloggers"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
    def show
        @blogger = Blogger.find(params[:id])