18-rails-review/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "blogger_id", "destination_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params)
    @post.likes = 0
    if @post.valid?
      @post.save

UPDATE "posts" SET "title" = ?, "content" = ?, "blogger_id" = ?, "destination_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?
---
  def update
    if @post.update(post_params)

UPDATE "posts" SET "likes" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["likes", 1], ["updated_at", "2020-04-08 23:23:33.939559"], ["id", 41]]
---
  def add_like
    @post.likes += 1
    @post.save

SELECT "destinations".* FROM "destinations"
SELECT "bloggers".* FROM "bloggers"
---
  def set_collections
    @destinations = Destination.all
    @bloggers = Blogger.all